In [2]:
import pandas as pd

data = {
    "Name": [
        "John Doe",
        "Jane Smith",
        "Peter Jones",
        "Linda Taylor",
        "Emily Clark",
        "David Smith",
        "Michael Brown",
        "Sarah Johnson",
    ],
    "Position": [
        "Software Engineer",
        "Data Scientist",
        "Project Manager",
        "HR Specialist",
        "Data Scientist",
        "Software Engineer",
        "HR Specialist",
        "Project Manager",
    ],
    "Office": [
        "New York",
        "San Francisco",
        "Berlin",
        "London",
        "San Francisco",
        "New York",
        "London",
        "Berlin",
    ],
    "Age": [28, 34, 45, 32, 30, 38, 41, 29],
    "Salary": [95000, 125000, 75000, 85000, 115000, 105000, 90000, 80000],
}

df = pd.DataFrame(data)
print(df.head())
print(df.tail())

           Name           Position         Office  Age  Salary
0      John Doe  Software Engineer       New York   28   95000
1    Jane Smith     Data Scientist  San Francisco   34  125000
2   Peter Jones    Project Manager         Berlin   45   75000
3  Linda Taylor      HR Specialist         London   32   85000
4   Emily Clark     Data Scientist  San Francisco   30  115000
            Name           Position         Office  Age  Salary
3   Linda Taylor      HR Specialist         London   32   85000
4    Emily Clark     Data Scientist  San Francisco   30  115000
5    David Smith  Software Engineer       New York   38  105000
6  Michael Brown      HR Specialist         London   41   90000
7  Sarah Johnson    Project Manager         Berlin   29   80000

In [4]:
df[["Age", "Name"]]

   Age           Name
0   28       John Doe
1   34     Jane Smith
2   45    Peter Jones
3   32   Linda Taylor
4   30    Emily Clark
5   38    David Smith
6   41  Michael Brown
7   29  Sarah Johnson

In [16]:
#.loc

df.loc[0]

#범위 행 선택(슬라이싱을 하지만 끝행번호도 포함됨)
df.loc[2:4]

#복수행 선택
df.loc[[0,2,4]]

# #단일 열 선택
# print(df.loc[:,"Name"])

# #복수 열 선택
# print(df.loc[:,["Age","Name"]])

#실습
print(df.loc[[1,3,5],["Name","Salary"]])

모든 행에 대한 범위 열 선책

           Name  Salary
1    Jane Smith  125000
3  Linda Taylor   85000
5   David Smith  105000

In [22]:
# .iloc

# 단일 행 선택
print(df.iloc[0])

# 범위 행 선택
print(df.iloc[0:5])

# 복수 행 선택
print(df.iloc[[0, 2]])

# 모든 행에 대한 첫 번째 열을 선택해서 출력
print(df.iloc[:, 0])

Name                 John Doe
Position    Software Engineer
Office               New York
Age                        28
Salary                  95000
Name: 0, dtype: object
           Name           Position         Office  Age  Salary
0      John Doe  Software Engineer       New York   28   95000
1    Jane Smith     Data Scientist  San Francisco   34  125000
2   Peter Jones    Project Manager         Berlin   45   75000
3  Linda Taylor      HR Specialist         London   32   85000
4   Emily Clark     Data Scientist  San Francisco   30  115000
          Name           Position    Office  Age  Salary
0     John Doe  Software Engineer  New York   28   95000
2  Peter Jones    Project Manager    Berlin   45   75000
0         John Doe
1       Jane Smith
2      Peter Jones
3     Linda Taylor
4      Emily Clark
5      David Smith
6    Michael Brown
7    Sarah Johnson
Name: Name, dtype: object

In [36]:
# 필터링
# 부서가 데사인 데이터만 추출
df[df["Position"] == "Data Scientist"]

# age가 30 초과인 행만 필터링하는 코드를 작성
df[df["Age"] > 30]

# 복수조선
# 파이썬 논리연산자 and or
# 판다스 논리 연산자 &(앰퍼샌드) |(파이프) 

#position이 data scientist age가 40보다 큰
print((df["Position"]=="Data Scientist") & (df["Age"] > 31))

#실습
print(df[(df["Office"]=="New work") | (df["Age"] > 40)])

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool
            Name         Position  Office  Age  Salary
2    Peter Jones  Project Manager  Berlin   45   75000
6  Michael Brown    HR Specialist  London   41   90000

In [41]:
#isin
#Position이 software Engineer,Data Scientist, HR specialist
filtering = df["Position"].isin(["Software Engineer","Data Scientist"," HR Specialist"])
print(df[filtering])

          Name           Position         Office  Age  Salary
0     John Doe  Software Engineer       New York   28   95000
1   Jane Smith     Data Scientist  San Francisco   34  125000
4  Emily Clark     Data Scientist  San Francisco   30  115000
5  David Smith  Software Engineer       New York   38  105000